/* 
    조건문 : 조건문 문법
        - 조건의 결과값 : true  / false
        - 삼항연산자 : 간단한 조건문 
        1. if 조건문 : 조건문을 표현 가능한 문법
            - 조건에 true/ false , 비교연산 또는 관계연산
        
        2. if 형태
         1. if( 조건 ) 참일경우코드;
         2. if( 조건 ) {참일경우코드; 참일경우코드;}
         3. if( 조건 ) {참일경우코드}
            else { 거짓일경우코드; }
        4. if(조건) {참일경우코드;}
            else if(조건2){ 참2일경우코드;}
            else if(조건3){ 참3일경우코드;}
            else if(조건4){ 참4일경우코드;}
            else if{거짓일경우 코드}
        
        5. if중첩
            if (조건){
            if(조건){}
                else{}
            } else{}

    - 주의할점 : if (조건) {} 사이에 ; (세미콜론)는 없이 작성
*/