/* 
    주제 : tolist 구현하기.

    1. 시각화
        html로 형태 구상

    2. 입력 정리
        텍스트입력, 등록 , 알림창, 버튼, 삭제버튼,

    3. 기능정리
        
        1.텍스트 입력후 등록시 할일 추가

        2.알림창 확인 출력

        3.변경누를시 css 변경

        4.삭제시 출력한거 사라짐

    4. 상세 기능 정리 
         html - 제목
         텍스트 상자 등록버튼

        div 글씨 출력 버튼 두개

         css - 제목 텍스트 두깨 두껍게
                텍스트 상자 쉐도우
                html div칸 -핑크 및 클릭시 줄가로 블랙 변경

        js-  텍스트 값 가져오기
            등록값 배열저장후 꺼내와서 출력


    개발순서 (참고하기)
        1. 구현할 화면을 스케치(프토타입)작성
        2. 구성한 화면을 HTML과 CSS로 샘플 작성하기.
        


*/