/* 
    반복문 
        - 조건 충족할때 특정 범위내 코드를 반복 실행 
        - 형태 
            for(초기값; 조건문; 증감식){
                실행문;
            }
            1. 초기값 : 반복을 할때 반복의 카운터/ 횟수 체크하는 변수의 처음값
            2. 조건문 : 반복실행문이 실행되는 조건으로 true 이면 {} 실행 아니면 for 종료
            3. 증감식 : 반복변수의 증가++-- 혹은 감소 변화 연산식
            4. 실행문 : 조건문이 true 일때 실행할 코드
        
        - 컴퓨터가 읽어드리는 흐름순서
            1. 초기값 -> 2. 조건문(true) -> 3.실행문 -> 4. 증감식 -> 5. 조건문(true) -> 6.실행문
                                                    . 증감식 -> 5. 조건문(true) -> 6.실행문
                                                    . 증감식 -> 5. 조건문(true) -> 6.실행문
                                                    . 증감식 -> 5. 조건문(false) -> 종료
        
        
         - 주체(누가) 어디서부터 어디까지 증감하면서 반복하는 지
         예]

        유재석이 계단 1칸부터 10칸 1칸까지 1칸씩 오른다를 반복

        for(let 유재석위치=1; 유재석위치 <= 10 ; 유재석위치++) {
            오른다
        }


*/
//[1] '안녕하세요' 5번 출력하세요. -> 1번 작성후 -> 복사 붙여넣기 
console.log('안녕하세요.');
console.log('안녕하세요.');
console.log('안녕하세요.');
console.log('안녕하세요.');
console.log('안녕하세요.');

//[2] '안녕하세요.' 1000번 출력하세요.

//[3] 1부터 5까지 출력하세요.
console.log(1);
console.log(2);
console.log(3);
console.log(4);
console.log(5);

//[4] 반복(중복)되는 코드와 반복되지 않는 코드
// 중복되는 코드 : console.log(); 
// 중복되지 않는 코드 1 2 3 4 5  // 중복되지 않는 코드 패턴 : 1부터 5까지 1씩 증가
//1. 초기값 : 1
//2. 조건문 : <=5
//3. 증감식 : +1 또는 ++
// 4. 실행문 (반복코드) : console.log()
for( let 반복변수 = 1; 반복변수 <=5 ; 반복변수++ ) {
        console.log(반복변수);
}
    //i = iterater 기본적으로 예시로 i를 씀

//[5] 1부터 10까지 누적 합계를 계산하시오.
//처음에는 [반복문 없이] 함수있는상태와 없는상태를 비교해서 봐보기 

let 총합계 = 0;          // 총합계 라는 변수에 0 대입
                            // 총합계 = 총합계 + 값; vs 총합계 +=값; 둘다 가능 잘되면 오른쪽 쓰기

총합계 = 총합계 + 1;        // 총합계 변수를 호출해서 +1 한 결과를 총합계에 대합, 총합계 1
총합계 = 총합계 + 2;        
총합계 = 총합계 + 3;        
총합계 = 총합계 + 4;        
총합계 = 총합계 + 5;       
총합계 = 총합계 + 6;        
총합계 = 총합계 + 7;        
총합계 = 총합계 + 8;        
총합계 = 총합계 + 9;        
총합계 = 총합계 + 10;

//반복되는 코드  : 총합계 = 총합계 +
//반복되지 않는 코드 : let 총합계 = 0; , 1 2 3 4 5 6 7 8 9 10
// 반복도 되지않는 코드 순서/ 패턴 : 1부터 10까지 1씩 증가
//[반복문 코드]

let sum = 0;
for( let 숫자패턴 =1 ; 숫자패턴 <= 10 ; 숫자패턴 ++){ // 숫자는 1부터 10이하까지 1씩 증가 반복
    총합계 = 총합계 + 숫자패턴
}// for end

//[6] 2단의 구구단을 출력하시오.
//[반복문 없이]

console.log( `2 x 1 = ${2*1}`);
console.log( `2 x 2 = ${2*2}`);
console.log( `2 x 3 = ${2*3}`);
console.log( `2 x 4 = ${2*4}`);
console.log( `2 x 5 = ${2*5}`);
console.log( `2 x 6 = ${2*6}`);
console.log( `2 x 7 = ${2*7}`);
console.log( `2 x 8 = ${2*8}`);
console.log( `2 x 9 = ${2*9}`);
// 반복되는 코드 : comsole.log (`2 x ? = ${2*?}`);
// 반복되지 않는 코드 : 1 2 3 4 5 6 7 8 9
// 반복되지 않는 코드 순서/패턴 : 1부터 9까지 1씩 증가 반복
//[반복문 코드]
for(let 곱 = 1; 곱 <= 9; 곱++) {// 곱은 1부터 곱은 9 이하까지 곱은 1씩 증가 반복
    comsole.log (`2 x ${곱} = ${2*곱}`);
}









