
/* <!-- [1] 아래 배열을 이용한 아래 출력 형식으로 구현하기
영화이름 목록,
movieName = ['히든페이스', '위키드', '그래디에터2', '청설']


영화 평점 목록, 각 영화별 평점은 10점 만점
movieRating = [8,4,7,6]
3. HTML 예시
    히든페이스       ★★★★★★★★☆☆
    위키드           ★★★★☆☆☆☆☆☆
    글래디에이터2    ★★★★★★★☆☆☆
    청설             ★★★★★★☆☆☆☆

기본적으로 규칙성을 찾아보자 
기본적으로 html로 리스트 형식으로 나오게끔 표현한다
별을 검정과 흰색을 변수에 저장한다.
4부터 6, 7, 8 까지는 있으므로 5만 반복문에서 제외한다.

*/




    













/*
[문제2] 6개 시트 / 좌석이 존재하는 좌석 상태 출력하시오.
    1. 좌석은 총 6개 , 빈좌석인지 예약석인지는 임의로 배열로 구성
    2. 아래와 같이 좌석을 2칸씩 3줄을 출력한다.
    3. 빈좌석이면 blue 색상표기, 예약석이면 red 색상 표기 하시오.

    4. HTML예시
    예약석 빈좌석
    예약석 빈좌석
    예약석 빈좌석

일단 배열로는 구성

if문으로 이거나 아니면 red , blue 표기
그리고 넣기 
배열을 html로 출력하기위해 배열안에 있는것들을 리스트에 넣어서 저장
출력



--> */

let 좌석 = [red, blue];

let 좌석배치 = <ul>
                <li></li>
                <li></li>
                <li></li>
              </ul>




